/**
 * Домашнє завдання 14
 *    1. Написати програму, що замінює підстрічку в файлі заданою стрічкою
 *    2. Написати програму, що копіює зміст текстового файлу в інший з розширення
 *      ".bak". Назва файлу вводиться користувачем.
 *    3. Написати програму, що відкриває файл на читання і формує два інших файли.
 *       Перший файл формується з непарних стрічок початкового файлу, а інший з парних.
 *    4. Здійснити шифрування файлу використовуючи зсув символів.
 *    5. Здійснити розшифрування файлу зашифрованого вище
 */
fun main() {
    do {
        when(menu()) {
            1 -> FileWorker().fileReplace()
            2 -> FileWorker().bak()
            3 -> FileWorker().oddAndEvenFiles()
            4 -> FileWorker(1).cipher()
            5 -> FileWorker(2).cipher()
        }
        println("Для завершення введіть 'q', інакше натисніть Enter")
    } while (readLine() != "q")
}

/**
 * Головне меню програми
 */
fun menu(): Int {
    println("""
        1. Заміна substr в файлі
        2. Копіювання файлу з розширенням ".bak"
        3. Непарні та парні строки
        4. Шифрування файлу
        5. Розшифрування файлу""".trimIndent())

    return generateSequence {
        readLine()?.toIntOrNull()?.takeIf { it in 1..5 }
    }.first()
}
